mahdidadashi65/STM32_Class_Project/STM32_Class_S3/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SEGC_Pin GPIO_PIN_2
#define SEGC_GPIO_Port GPIOE
#define SEGD_Pin GPIO_PIN_3
#define SEGD_GPIO_Port GPIOE
#define SEGE_Pin GPIO_PIN_4
#define SEGE_GPIO_Port GPIOE
#define SEGF_Pin GPIO_PIN_5
#define SEGF_GPIO_Port GPIOE
#define SEGG_Pin GPIO_PIN_6
#define SEGG_GPIO_Port GPIOE
#define SW1_Pin GPIO_PIN_0
#define SW1_GPIO_Port GPIOA
#define SW2_Pin GPIO_PIN_1
#define SW2_GPIO_Port GPIOA
#define SW2_EXTI_IRQn EXTI1_IRQn
#define SW3_Pin GPIO_PIN_2
#define SW3_GPIO_Port GPIOA
#define SW3_EXTI_IRQn EXTI2_IRQn
#define SEG1_Pin GPIO_PIN_10
#define SEG1_GPIO_Port GPIOE
#define SEG2_Pin GPIO_PIN_11
#define SEG2_GPIO_Port GPIOE
#define LED1_Pin GPIO_PIN_0
#define LED1_GPIO_Port GPIOD
#define LED2_Pin GPIO_PIN_1
#define LED2_GPIO_Port GPIOD
#define SEGA_Pin GPIO_PIN_0
#define SEGA_GPIO_Port GPIOE
#define SEGB_Pin GPIO_PIN_1
#define SEGB_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
